Tekla.Structures.DrawingInternal.PropertyType
Type of property: int/double/string

Tekla.Structures.DrawingInternal.PropertyType.TYPE_INT
Integer

Tekla.Structures.DrawingInternal.PropertyType.TYPE_DOUBLE
Double

Tekla.Structures.DrawingInternal.PropertyType.TYPE_STRING
String